{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"LSTM","config":{"units":60,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM2","trainable":true,"batch_input_shape":[null,7,76],"dtype":"float32"}},{"class_name":"Dense","config":{"units":76,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}}],"keras_version":"tfjs-layers 1.0.3","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.3","convertedBy":null,"weightsManifest":[{"paths":["./mobydick.weights.bin"],"weights":[{"name":"lstm_LSTM2/kernel","shape":[76,240],"dtype":"float32"},{"name":"lstm_LSTM2/recurrent_kernel","shape":[60,240],"dtype":"float32"},{"name":"lstm_LSTM2/bias","shape":[240],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[60,76],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[76],"dtype":"float32"}]}]}